kernel/net/critical_data_struct.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-03-10 Wed 22:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>关键数据结构</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">关键数据结构</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0b4acc5">1. 套接字缓存：sk_buff结构体</a></li>
<li><a href="#org4cba93c">2. net_device结构体</a></li>
</ul>
</div>
</div>
<p>
在阅读本系列的后续文章和研究内核网络代码时，会不时参考几个关键结构，自然对其中的各个域也要有一定的理解。
</p>

<p>
本文会介绍下面这些数据结构，并且会提及某些操作这些数据结构的函数和宏：
</p>
<ul class="org-ul">
<li><p>
struct sk_buff
</p>

<p>
用于存放一个packet。该结构体会被所有网络层用到，存放头部信息，用户数据（负载payload）信息，以及其它需要协调工作的信息。
</p></li>

<li><p>
struct net_device
</p>

<p>
在内核中的网络设备都由这个结构体表示，它包含有硬件以及软件配置信息。后面的系列文章会介绍它的分配。
</p></li>
</ul>

<p>
另外还有一个关键数据结构是struct sock，它用来存储套接字的网络信息，不过这不是本系列文章的重点。
</p>
<div id="outline-container-org0b4acc5" class="outline-2">
<h2 id="org0b4acc5"><span class="section-number-2">1</span> 套接字缓存：sk_buff结构体</h2>
<div class="outline-text-2" id="text-1">
<p>
这个结构体或许是Linux内核网络里最重要的数据结构了，表示了到达或要传输数据的的头部信息，定义在include/linux/skbuff.h文件里，这个结构体包含了大量的成员。
</p>

<p>
在内核开发的历史上，这个结构体改变了许多次，包括添加新的选项，重排已经存在的成员，这些域大致可以分为以下四类：
</p>
<ul class="org-ul">
<li>布局</li>
<li>通用</li>
<li>特定功能相关的</li>
<li>管理函数</li>
</ul>

<p>
这个结构体会被几个不同的网络层（包括MAC或者其它在第二层的链路层协议，L3层上的IP，L4层上的TCP或UDP）使用到，并且随着包从一层传到另一层，结构体中的各个域也会改变。
</p>
</div>
</div>
<div id="outline-container-org4cba93c" class="outline-2">
<h2 id="org4cba93c"><span class="section-number-2">2</span> net_device结构体</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2021-03-10 Wed 22:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
